{
  [*] Мигунов Виталий Владимирович
  [*] ИВТ-16-2
  [*] Вариант: 16
  [*] Задание: 33a
  [*] Даны действительные числа x, y. Получить: а) max(x, y);
}
program number33;
var
  x, y, max: real;  //основные переменные

begin
  //----- Вводим N числа ----------------------------
  write('Введите значение X: ');
  read(x);
  write('Введите значение Y: ');
  read(y);
  //--------------------------------------------------
  
  //----- Мозг программки ----------------------------
  if x >= y then
    max := x
  else
    max := y;
  //--------------------------------------------------
  
  //----- Выводим полученный результат --------------- 
  write('Максимальное число: ', max);
  //--------------------------------------------------
  
end.