{ 
  [*] Мигунов Виталий Владимирович
  [*] ИВТ-17-1
  [*] Вариант: 16
  [*] Задание: 11Ж
  [*] Даны x, y, z. Вычислить a, b 
}
program number11;
var
  x, y, z: real;  //основные переменные
  v, resa, resb: real; //второстепенные переменные

begin
  //----- Вводим N числа ----------------------------
  write('Введите значение X: ');
  readln(x);
  write('Введите значение Y: ');
  readln(y);
  write('Введите значение Z: ');
  readln(z);
  //--------------------------------------------------
  
  //----- Математические формулки --------------------
  v := (y - sqrt(abs(x))) * (x - (y / (z + sqr(x) / 4)));
  resa := Ln(abs(v));
  
  resb := x - sqr(x) / 6 + {exp(ln(x)*5)} Power(x, 5)  / 120;
  //--------------------------------------------------
  
  //----- Выводим полученный результат --------------- 
  writeln('Число a: ', resa:1:0);
  writeln('Число b: ', resb:1:0);
  //--------------------------------------------------
  
end.