{
  [*] Мигунов Виталий Владимирович
  [*] ИВТ-16-2
  [*] Вариант: 16
  [*] Задание: 11Ж
  [*] Даны x, y, z. Вычислить a, b 
}
program number11;
var
  x, y, z: real;  //основные переменные
  v, resulta, resultb: real; //второстепенные переменные

begin
  //----- Вводим N числа ----------------------------
  write('Введите значение X: ');
  readln(x);
  write('Введите значение Y: ');
  readln(y);
  write('Введите значение Z: ');
  readln(z);
  //--------------------------------------------------
  
  //----- Математические формулки --------------------
  v := (y - sqrt(abs(x))) * (x - (y / (z + sqr(x) / 4)));
  resulta := Ln(abs(v));
  
  resultb := x - sqr(x) / 6 + exp(ln(x)*5) / 120;
  //--------------------------------------------------
  
  //----- Выводим полученный результат --------------- 
  writeln('Число a: ', resulta:1:0);
  writeln('Число b: ', resultb:1:0);
  //--------------------------------------------------
  
end.